random-benchmark/logs/qwen25-7b-1gpu-result_num_prompt_24_input_len_1024.log
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-7B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=24, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 24/24 [00:27<00:00,  1.15s/it]
============ Serving Benchmark Result ============
Successful requests:                     24        
Benchmark duration (s):                  27.52     
Total input tokens:                      24576     
Total generated tokens:                  12831     
Request throughput (req/s):              0.87      
Output token throughput (tok/s):         466.25    
Total Token throughput (tok/s):          1359.30   
---------------Time to First Token----------------
Mean TTFT (ms):                          3754.42   
Median TTFT (ms):                        3710.41   
P99 TTFT (ms):                           6344.70   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          44.58     
Median TPOT (ms):                        44.49     
P99 TPOT (ms):                           51.67     
---------------Inter-token Latency----------------
Mean ITL (ms):                           47.09     
Median ITL (ms):                         41.50     
P99 ITL (ms):                            82.26     
==================================================