random-benchmark/logs/qwen25-7b-1gpu-result_num_prompt_2_input_len_4096.log
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-7B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 2/2 [00:13<00:00,  6.88s/it]
============ Serving Benchmark Result ============
Successful requests:                     2         
Benchmark duration (s):                  13.77     
Total input tokens:                      8192      
Total generated tokens:                  1061      
Request throughput (req/s):              0.15      
Output token throughput (tok/s):         77.06     
Total Token throughput (tok/s):          672.07    
---------------Time to First Token----------------
Mean TTFT (ms):                          1654.53   
Median TTFT (ms):                        1654.53   
P99 TTFT (ms):                           2170.68   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.94     
Median TPOT (ms):                        22.94     
P99 TPOT (ms):                           24.70     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.84     
Median ITL (ms):                         22.66     
P99 ITL (ms):                            23.14     
==================================================